
Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.GetValue
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.GetKey
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.HasCurrent
Identifies whether the iterator has a current item.
There is no current item if the iterator has not started yet or has been done.
Returns:
True if there is a current item.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Reset
Resets the iterator to the initial state.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items.  False if there are more items to be iterated.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.MoveNext
Increments the enumerator to the next item.
Returns:
True if there is a next available item in this enumerator.
False if the enumerator has completed all available items.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
An iterator to a set of items from DuctSizeSettings. Each item is a KeyValuePair(DuctShape::Enum, DuctSizes).
Since:
2013