
Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.GetCurrent
Returns the current KeyBasedTreeEntry object.
Returns:
The current KeyBasedTreeEntry object.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Reset
Resets the iterator to the initial state.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items.  False if there are more items to be iterated.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.MoveNext
Increments the iterator to the next item.
Returns:
True if there is a next available item in this iterator.
False if the iterator has completed all available items.
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
An iterator to a set of KeyBasedTreeEntry objects.
Since:
2015