
Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.HasCurrent
Identifies if the iterator has a current item.
Remarks:
There is no current item if the iterator has not started yet or has been done.
Returns:
True if there is a current item.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.GetCurrent
Returns the current ConduitSize.
Returns:
The current ConduitSize.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Reset
Resets the iterator to the initial state.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items.  False if there are more items to be iterated.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.MoveNext
Increments the iterator to the next item.
Returns:
True if there is a next available item in this iterator.
False if the iterator has completed all available items.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ConduitSizeIterator
An iterator to a set of conduit sizes from ConduitSizes.
Since:
2017