
Autodesk.Revit.DB.Structure.RebarContainerIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.Structure.RebarContainerIterator.GetCurrent
Returns the current rebar container item.
Returns:
The current rebar container item.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerIterator.Reset
Resets the iterator to the initial state.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerIterator.MoveNext
Increments the iterator to the next item.
Remarks:
After an enumerator is created or after the Reset method is called, an enumerator is positioned before the first element of the collection,
and the first call to the MoveNext method moves the enumerator over the first element of the collection.
Returns:
True if there is a next available item in this iterator.
False if the iterator has completed all available items.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarContainerIterator
An iterator to a Rebar Container.
Since:
2016