
Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.GetValue
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.GetKey
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.HasCurrent
Identifies whether the iterator has a current item.
There is no current item if the iterator has not started yet or has been done.
Returns:
True if there is a current item.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Reset
Resets the iterator to the initial state.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items.  False if there are more items to be iterated.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.MoveNext
Increments the enumerator to the next item.
Returns:
True if there is a next available item in this enumerator.
False if the enumerator has completed all available items.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes).
ElementId is the id of the conduit standard type.
Since:
2017