
Autodesk.Revit.DB.ExportLinetypeTableIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.ExportLinetypeTableIterator.GetValue
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator.GetKey
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator.Reset
Resets the iterator to the initial state.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items. False if there are more items to be iterated.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator.MoveNext
Increments the iterator to the next item.
Returns:
True if the iteration has no more items. False if there are more items to be iterated.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTableIterator
An iterator to a set of line type table.
Since:
2014